{
  "docs": [
    {
      "id": "65e8987edff6423999ac1b11",
      "hiddenPost": false,
      "_status": "published",
      "createdAt": "2024-03-06T16:23:26.690Z",
      "updatedAt": "2024-08-14T09:21:14.285Z",
      "content": [
        {
          "children": [
            {
              "text": "Some extras that we offer and will organise for your perfect stay: ",
              "bold": true
            }
          ]
        },
        {
          "children": [
            {
              "text": "Dreamful Weddings: "
            }
          ],
          "type": "h3"
        },
        {
          "children": [
            {
              "text": "Celebrate your special day in a picturesque setting, with tailored wedding services that ensure every detail of your dream wedding is flawlessly executed. From stunning decor to exquisite catering, create unforgettable memories in a romantic paradise."
            }
          ]
        },
        {
          "children": [
            {
              "text": "Private Transfer & Excursions:"
            }
          ],
          "type": "h3"
        },
        {
          "children": [
            {
              "text": "Enjoy the convenience of private transfers and curated excursions, designed to enhance your stay with seamless transportation and exclusive tours. Explore the region's hidden gems and iconic landmarks in comfort and style."
            }
          ]
        },
        {
          "children": [
            {
              "text": "Private Chef:"
            }
          ],
          "type": "h3"
        },
        {
          "children": [
            {
              "text": "Indulge in gourmet dining experiences with a personal chef who crafts exquisite meals tailored to your tastes. Savor culinary delights in the comfort of your villa, transforming every meal into a memorable occasion."
            }
          ]
        },
        {
          "children": [
            {
              "text": "Rent a Boat:"
            }
          ],
          "type": "h3"
        },
        {
          "children": [
            {
              "text": "Experience the freedom of the open sea with a private boat rental, perfect for exploring beautiful coastlines, hidden coves, and nearby islands. Whether for leisure or adventure, a day on the water promises unforgettable moments."
            }
          ]
        },
        {
          "children": [
            {
              "text": "Rent a Car:"
            }
          ],
          "type": "h3"
        },
        {
          "children": [
            {
              "text": "Discover the local area at your own pace with a rental car, providing the flexibility to explore scenic routes, visit charming towns, and uncover off-the-beaten-path treasures. Enjoy the freedom and convenience of having your own vehicle during your stay."
            }
          ]
        },
        {
          "children": [
            {
              "text": "Concierge Service:"
            }
          ],
          "type": "h3"
        },
        {
          "children": [
            {
              "text": "Benefit from a dedicated concierge service that caters to your every need, ensuring a personalized and stress-free vacation. From restaurant reservations to activity planning, our concierge is here to make your stay truly exceptional."
            }
          ]
        }
      ],
      "photo": {
        "id": "66a776aadff6423999addca0",
        "filename": "NRL_9719-1.webp",
        "mimeType": "image/webp",
        "filesize": 247360,
        "width": 3600,
        "height": 2403,
        "createdAt": "2024-07-29T11:02:02.074Z",
        "updatedAt": "2024-07-29T11:02:02.074Z",
        "url": "/photos/NRL_9719-1.webp"
      },
      "title": "Extras"
    },
    {
      "id": "65e89833dff6423999ac1a81",
      "hiddenPost": false,
      "_status": "published",
      "createdAt": "2024-03-06T16:22:11.796Z",
      "updatedAt": "2024-08-14T09:13:41.717Z",
      "content": [
        {
          "type": "h2",
          "children": [
            {
              "text": "Our Story"
            }
          ]
        },
        {
          "children": [
            {
              "text": "Welcome to TST-Touristik, where our mission is to povide you with a luxurious and relaxed stay in Croatia. Founded in 2003/2004 by Mladen Tomasevic, we've grown from a humble beginning in Split to serving customers all over Dalmatia. Our journey is one of passion, dedication, and a commitment to quality that's reflected in everything we do."
            }
          ]
        },
        {
          "children": [
            {
              "text": "We are proud members of the largest Croatian agency association, UHPA, and the German-Croatian Chamber of Industry and Commerce in Zagreb. For several years in a row, we have been recognized by Bellevue Europe as the Best Property Agency in Croatia. In 2023 and 2024, we received the Prestige Award for our professionalism in luxury rentals in Croatia."
            }
          ]
        },
        {
          "type": "h2",
          "children": [
            {
              "text": "Our Team"
            }
          ]
        },
        {
          "children": [
            {
              "text": "Our team is comprised of highly experienced professionals who have built their expertise through education and work in Germany over many years. When we arrived in Croatia in 2003/2004, we immediately applied the highest local standards in the market for our services, just as we had learned and practised in the West for many years prior."
            }
          ]
        },
        {
          "children": [
            {
              "text": "Over time, we have managed to assemble a very professional team for comprehensive solutions, all under one roof, proven and secure."
            }
          ]
        },
        {
          "children": [
            {
              "text": "Together, we work tirelessly to ensure a premium experience for our guests, constantly enhancing our selection of luxurious villas and providing exceptional customer support, making your stay in Dalmatia unforgettable."
            }
          ]
        },
        {
          "type": "h2",
          "children": [
            {
              "text": "Why Choose Us"
            }
          ]
        },
        {
          "children": [
            {
              "text": "What sets us apart is our unwavering commitment to luxury, customer service and quality. We believe in reliability, traceability and integrity, ensuring that we not only fulfil your expectations, but exceed them. Our commitment to these values means that every aspect of your stay is carefully selected to provide you with an unrivalled experience that will leave you with treasured memories of your time in beautiful Dalmatia."
            }
          ]
        },
        {
          "children": [
            {
              "text": "We are also recognised as a specialist agency for villa owners from German-speaking countries and use our bilingualism to offer attractive solutions for non-EU owners with our tax saving schemes. This expertise allows us to offer customised services that meet the unique needs of international property owners."
            }
          ]
        }
      ],
      "photo": {
        "id": "65be832fa47b43f9b04303ca",
        "filename": "SB_Drone_11-1.webp",
        "mimeType": "image/webp",
        "filesize": 1076598,
        "width": 3992,
        "height": 2242,
        "createdAt": "2024-02-03T18:17:19.621Z",
        "updatedAt": "2024-07-02T15:07:41.659Z",
        "url": "/photos/SB_Drone_11-1.webp"
      },
      "title": "About us"
    },
    {
      "id": "65e896c6dff6423999ac1971",
      "hiddenPost": false,
      "_status": "published",
      "createdAt": "2024-03-06T16:16:06.724Z",
      "updatedAt": "2024-08-14T09:17:13.848Z",
      "content": [
        {
          "children": [
            {
              "text": "We're here to help! Whether you have a question, feedback, or need support, our team is eager to assist you. Reach out to us  and we'll make sure to get back to you as soon as possible."
            }
          ]
        },
        {
          "type": "h2",
          "children": [
            {
              "text": "Get In Touch"
            }
          ]
        },
        {
          "children": [
            {
              "text": "Email Us",
              "bold": true
            },
            {
              "text": ": For inquiries, support, or feedback, drop us an email at info@tst-touristik.de"
            },
            {
              "newTab": false,
              "type": "link",
              "url": null,
              "children": [
                {
                  "text": ""
                }
              ]
            },
            {
              "text": ". We aim to respond within 24 hours."
            }
          ]
        },
        {
          "children": [
            {
              "text": "Call Us",
              "bold": true
            },
            {
              "text": ": Need to speak with someone directly? Our team is available at "
            }
          ]
        },
        {
          "children": [
            {
              "text": "(croatian) Tel: +385 21 221 404  Mob: +385 98 1934243 "
            }
          ]
        },
        {
          "children": [
            {
              "text": "(german) Tel: +49 201 4764977 Mob: +49 1573 4517826"
            }
          ]
        },
        {
          "children": [
            {
              "text": "from Monday to Friday, 9 AM to 5 PM ."
            }
          ]
        },
        {
          "children": [
            {
              "text": ""
            }
          ]
        },
        {
          "type": "ul",
          "children": [
            {
              "text": "\n"
            }
          ]
        }
      ],
      "photo": {
        "id": "66826224dff6423999ad4a93",
        "filename": "SB_Drone_15-1.webp",
        "mimeType": "image/webp",
        "filesize": 2550352,
        "width": 4500,
        "height": 2998,
        "createdAt": "2024-07-01T08:00:36.940Z",
        "updatedAt": "2024-07-01T08:00:53.231Z",
        "url": "/photos/SB_Drone_15-1.webp"
      },
      "title": "Contact us"
    },
    {
      "id": "65c0ec0d6aa1d2146296e9ce",
      "hiddenPost": false,
      "_status": "published",
      "createdAt": "2024-02-05T14:09:17.613Z",
      "updatedAt": "2024-08-23T09:18:14.988Z",
      "content": [
        {
          "children": [
            {
              "text": "1. General",
              "bold": true
            }
          ]
        },
        {
          "children": [
            {
              "text": "Our brand TST Villas and Apartments and our website www.tst-touristik.de are property of registered German tourist agency TST-Management, owner Mr Mladen Tomasevic, Holzstr.2, 45141 Essen and in additional Croatian tourist agency Tomasevic Menadzment d.o.o., Split – Petrica 10, Croatia, VAT: HR07299589726, ID code: HR-AB-21-060202517. We act as a mediator between the guest and the property owner. Through our website www.tst-touristik.de we provide accommodation and other services according to the information listed for each property and service on this website. It is highly recommended that you carefully read all the information on our website and check all the details that were confirmed to you in the time of booking you made with us, as these form the basis of your contract with us. By making the reservation for accommodation units or services from our website, you are entering a legal relationship with our agency and it is considered as the acceptance of the general terms and conditions."
            }
          ]
        },
        {
          "children": [
            {
              "text": "2. Booking &amp; payment",
              "bold": true
            }
          ]
        },
        {
          "children": [
            {
              "text": "For any accommodation unit or service listed on our website, you can make an online inquiry through our contact form, by sending us an email inquiry directly to our email address: "
            },
            {
              "newTab": false,
              "type": "link",
              "url": "mailto:info@tst-touristik.de",
              "children": [
                {
                  "text": "info@tst-touristik.de"
                }
              ]
            },
            {
              "text": ", contacting us on our mobile phone at +4915734517826, +385981934243 or through our partner agencies that advertise our services. After we receive your inquiry, we will provide you with the prices, availability, all the details and terms of a potential reservation via our e-mail. Reservation is valid after we receive the deposit payment which will be stated and defined in the pro forma invoice which we will send you after your booking confirmation. If the payment is not received within 3 working days, we will consider you"
            }
          ]
        },
        {
          "children": [
            {
              "text": "made a cancellation of your booking request. You should send us a payment"
            }
          ]
        },
        {
          "children": [
            {
              "text": "confirmation within 24 hours of making the payment. After the deposit payment is received in our agency’s account, you will receive a voucher with all the details of your reservation which will be the formal confirmation of your booking. The rest of the amount for your reservation should be paid according to the information provided in your voucher within the deadline stated in the voucher. If the rest of the amount is not paid within the agreed period, our agency can cancel your reservation. Our agency will use the deposit payment as the cancellation fee and to cover the eventual costs. Confirmation of the reservation is valid after payment of 30-50%of the total amount with the balance paid according to the terms delivered to the client in the contract and the voucher."
            }
          ]
        },
        {
          "children": [
            {
              "text": "Deposit payment is non-refundable if the guest makes the cancellation after making the payment or anytime until the arrival date."
            }
          ]
        },
        {
          "children": [
            {
              "text": "Balance payment is non-refundable if the reservation is cancelled within 60 days prior to arrival. Depending on the accommodation unit owner, the balance payment can be partially or fully refundable in some cases. This will be stated in the description of each property."
            }
          ]
        },
        {
          "children": [
            {
              "text": "A voucher is considered as a binding contract between the guest, the owner of the accommodation unit/service provider and the agency. In case of any disputes, only Croatian laws apply to the jurisdiction of the court in Split."
            }
          ]
        },
        {
          "children": [
            {
              "text": "You are obliged to provide information about the number of persons that will come to the"
            }
          ]
        },
        {
          "children": [
            {
              "text": "accommodation unit, or use the services of our agency. This number will be stated and confirmed in your voucher. In case the number of people who come to the accommodation unit exceeds the number of people indicated in the voucher, the service provider has the right to refuse to provide you with the service due to the unannounced guests or being unable to accommodate all the guests."
            }
          ]
        },
        {
          "children": [
            {
              "text": "Our agency will provide the services according to the information on our website and in emails our agency exchanges with you during the inquiry and booking procedure, with the exception of unforeseen situations, illness or death of the accommodation owner, host or their family members; extraordinary circumstances which cannot be predicted or eliminated such as natural disasters (earthquakes, floods, fires, droughts, etc), wars, strikes, terrorist acts and restrictions issued by the state (mobilization, ban on leaving the country etc)."
            }
          ]
        },
        {
          "children": [
            {
              "text": "Payment for the reservations can be made through wire transfer to our agency’s bank account. Please note, we will send you a pro forma invoice with our bank account number including all the company legal information. TST Villas &amp; Apartments advises the purchase of a cancellation insurance policy in the guest’s country, for which we will provide all the necessary documents and assist in order to protect the guest and their rights."
            }
          ]
        },
        {
          "children": [
            {
              "text": "3. Prices",
              "bold": true
            }
          ]
        },
        {
          "children": [
            {
              "text": "The prices for the accommodation units and services stated on our website are based on the prices known to us at the time they were published. These prices are subject to change and if that happens, we will inform you immediately about this. The information and prices shown on this website are updated from time to time and therefore may have changed by the time you come to book your accommodation or any other services we provide. Whilst every effort is made to ensure the accuracy of all such information and prices, regrettably errors do occasionally occur. You must therefore ensure you check all details of your chosen accommodation or any other service (including the price) at the time of booking."
            }
          ]
        },
        {
          "children": [
            {
              "text": "4. Agency’s obligations",
              "bold": true
            }
          ]
        },
        {
          "children": [
            {
              "text": "TST Villas & Apartments (brand of Tomasevic Menadzment d.o.o.) are responsible for providing the services stated on the website and in your voucher. The agency works in the best interest of the guest/client and will fulfil all of the above listed and described obligations, except in the extraordinary circumstances that the agency have no effect on or that occur as a result of force majeure."
            }
          ]
        },
        {
          "children": [
            {
              "text": "5. Guest’s / client’s obligations",
              "bold": true
            }
          ]
        },
        {
          "children": [
            {
              "text": "Guests have the following responsibilities:"
            }
          ]
        },
        {
          "children": [
            {
              "text": "– Provide all the relevant information to our agency concerning your group, the number of people arriving and using the service, their names and any other special requirements if there are any, prior to confirming the reservation with us"
            }
          ]
        },
        {
          "children": [
            {
              "text": "– Obey the customs, currency regulations and laws of the Republic of Croatia."
            }
          ]
        },
        {
          "children": [
            {
              "text": "– Respect the house rules of the accommodation you are renting, especially those regarding the check-in / check-out time and noise restrictions in the accommodation. In case the guest fails to comply with those regulations, the accommodation owner can at any time ask the guest to leave the premises."
            }
          ]
        },
        {
          "children": [
            {
              "text": "– Service is reserved exclusively for the person and accompanying persons named on your voucher and no other persons are permitted to stay at the accommodation nor can you arrange for visitors to the property for the purpose of events like parties, celebrations or other large gatherings unless this has been agreed with us in writing and appropriate payments made (if applicable)."
            }
          ]
        },
        {
          "children": [
            {
              "text": "– You and all members of your group also agree not to use the accommodation unit for any illegal or commercial purpose, including subletting it or otherwise allowing anyone to stay in it who we have not previously accepted on your voucher."
            }
          ]
        },
        {
          "children": [
            {
              "text": "– Upon your arrival to the accommodation unit, present the voucher to the host as a proof of your reservation. You are obliged to hand over the documents required for the registration at the Tourist office (such as identity cards or passports) to the accommodation owner/host, immediately upon arrival."
            }
          ]
        },
        {
          "children": [
            {
              "text": "– Pets are allowed only in some properties, so be sure to check before confirming the reservation if the accommodation accepts pets and if there will be any extra costs for this."
            }
          ]
        },
        {
          "children": [
            {
              "text": "– For some properties, there are no extra charges at the spot, but for some properties, there will be additional charges for the different services, such as final cleaning, tourist tax etc. Please be sure to check with us prior to making the reservation. In cases of non-compliance with these obligations, the guest/client shall pay for all the costs and be held responsible for any possible damages. By confirming the reservation, the guest agrees that, in case of any damage, he or she will pay for it to the service provider."
            }
          ]
        },
        {
          "children": [
            {
              "text": "6. Security damage deposit",
              "bold": true
            }
          ]
        },
        {
          "children": [
            {
              "text": "Information about the security damage deposit that each accommodation unit requires is either stated on our website following the information about the accommodation unit or it will be provided to you during our communication via email and finally written in your voucher. This deposit should be given to the accommodation owner/host upon arrival, usually in cash, in some accommodations via credit card or in some cases it should be paid in advance, prior to your arrival. Security damage deposit covers any damage caused to the accommodation unit. All guests at the accommodation unit are responsible for any damages done to the accommodation unit, its content and equipment, staff and third persons, during their stay. The guests are obliged to cover the entire amount of the damages, which will be specified by the accommodation unit owner/host. The amount of compensation will be deducted from the security deposit. If the amount of damages is higher than that of the security deposit, the guest is obliged to reimburse to the accommodation unit owner/host full compensation for the incurred damages. On departure, you should leave the accommodation in a reasonably clean and tidy condition so it can be efficiently prepared for the next guests. If additional cleaning has been necessary, a charge from the damage deposit will be made at the spot or an invoice will be sent to you on your return home. "
            }
          ]
        },
        {
          "children": [
            {
              "text": "7. Guest’s luggage",
              "bold": true
            }
          ]
        },
        {
          "children": [
            {
              "text": "Our agency cannot be held responsible for damaged, lost, destroyed or stolen luggage in the"
            }
          ]
        },
        {
          "children": [
            {
              "text": "accommodation unit."
            }
          ]
        },
        {
          "children": [
            {
              "text": "8. Tourist tax",
              "bold": true
            }
          ]
        },
        {
          "children": [
            {
              "text": "According to the law of the Republic of Croatia, all guests are obliged to pay tourist tax upon arrival to the accommodation unit. In some accommodation units, the tourist tax is included in the rental price and in some it is not included and it should be paid upon arrival. This information will be provided in the voucher. Tourist tax is about 1€ - 2€ per person per day. Children under 18 years of age pay only half of the amount for tourist tax while children under 12 years of age are not obliged to pay the tourist tax."
            }
          ]
        },
        {
          "children": [
            {
              "text": "9. Environment",
              "bold": true
            }
          ]
        },
        {
          "children": [
            {
              "text": "Many of our offered accommodation units are located within rural or isolated and private locations. For some of them, it will be possible to arrive only by boat. Some accommodation units are located on gravel roads and are possibly hard to reach, so please read the description of every accommodation unit on our website thoroughly. It is recommended that you mention to our booking department that you would want to know in advance about the kind of road is leading to the accommodation unit and all other aspects of the location before making the reservation. Our agency shall not be held responsible for any possible construction or road works near the accommodation unit."
            }
          ]
        },
        {
          "children": [
            {
              "text": "10. Insurance",
              "bold": true
            }
          ]
        },
        {
          "children": [
            {
              "text": "Our agency does not provide any insurance coverage. It is strongly recommended that you purchase personal travel insurance for yourself and all other members of your group. It is your responsibility to ensure that the insurance you purchase is suitable for your specific requirements. It is also recommended that you purchase insurance that will cover possible booking cancellations. Travel insurance remains the sole responsibility of the guest."
            }
          ]
        },
        {
          "children": [
            {
              "text": "11. Cancellation and amendments policy",
              "bold": true
            }
          ]
        },
        {
          "children": [
            {
              "text": "11a. Made by the guest",
              "underline": true
            }
          ]
        },
        {
          "children": [
            {
              "text": "Cancellation of the reservations made with our agency can be made only in written, via email. Paid deposit to secure the reservation is not refundable. Other deposits that need to be paid before arrival to the accommodation unit, will or will not be returned to the guest, depending on the accommodation unit owner’s policy. This policy will be presented to the guest upon reservation. In case of cancelling the reservation within the 7 days before the agreed arrival by guest, it is allowed for the guest to change the name of the reservation holder for the confirmed reservation period, if possible (depending on the accommodation unit owner and/or service provider). In this case, our agency could charge possible additional costs because of the reservation changes, if they occur. The new guest accepts all the obligations written within these Terms and Conditions. Guests can also make modifications to the reservations and these modifications may include: number of people arriving, changes to the names of the guests stated on the voucher, changes to the dates of the reservation (only when alternate date is available and at least 90 days prior the initial date of the reservation). These modifications will only be accepted in written form, via email."
            }
          ]
        },
        {
          "children": [
            {
              "text": "Our agency does not compensate for the cost of the visas, passports or any other required travel documents of the guest that may occur due to the cancellation of the reservation."
            }
          ]
        },
        {
          "children": [
            {
              "text": "If the guest does not check in to the accommodation unit until midnight on the arrival date of the reservation and does not inform our agency or the accommodation unit owner and/or service provider about it, the reservation will be cancelled and no deposit paid will be returned to the guest. If the actual costs exceed the deposit paid, our agency holds the right to charge these costs. If the guest is unable to check in on the arrival date of the reservation and has previously informed our agency, accommodation unit owner and/or service provider about it, the accommodation unit will be kept for the guest, based on the previous agreement and reservation voucher."
            }
          ]
        },
        {
          "children": [
            {
              "text": "11b. Made by the agency or accommodation unit owner/service provider",
              "underline": true
            }
          ]
        },
        {
          "children": [
            {
              "text": "Our agency holds the right to change and/or cancel the reservation made by the guest. If this occurs, the agency will try to find and offer similar accommodation of the same or higher category and price, but it will be previously agreed with the guest. If the price of the new accommodation exceeds the paid price, our agency holds the right to charge this price difference from the guest. If there is no possibility to find and offer an acceptable alternative accommodation unit, our agency holds the right to cancel the reservation and to inform the guest about it immediately. In this case, our agency is only obliged to refund the amount paid to the agency’s account and the guest has no right to request any other additional financial compensation."
            }
          ]
        },
        {
          "children": [
            {
              "text": "12. Complaints",
              "bold": true
            }
          ]
        },
        {
          "children": [
            {
              "text": "If any problem occurs during your stay in any of our accommodation units, it must be reported in written to the accommodation host / owner and our agency immediately as it happens. Our agency will answer all the complaints within 2 working days. If complaints are not submitted in this way, we will not be able to determine what caused the problem and amend your complaint. Any subsequent claims will not be accepted. Weather conditions in the destination, air and sea temperature, possible crowds in the destination"
            }
          ]
        },
        {
          "children": [
            {
              "text": "and/or conditions on public beaches, and any other unexpected situations that could affect guest dissatisfaction, can not be subject to guest complaints if they are not directly related to the quality of the booked accommodation unit."
            }
          ]
        },
        {
          "children": [
            {
              "text": "13. Final remarks",
              "bold": true
            }
          ]
        },
        {
          "children": [
            {
              "text": "Our agency reserves the right to make changes to these terms and conditions at any time without prior notice. If changes occur, the amended terms will be effective immediately when published on this website."
            }
          ]
        },
        {
          "children": [
            {
              "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n"
            }
          ]
        }
      ],
      "photo": {
        "id": "65b68898d66a11316175c0be",
        "filename": "01-21.webp",
        "mimeType": "image/webp",
        "filesize": 243348,
        "width": 4000,
        "height": 6000,
        "createdAt": "2024-01-28T17:02:16.153Z",
        "updatedAt": "2024-01-28T17:02:16.153Z",
        "url": "/photos/01-21.webp"
      },
      "title": "Terms & Conditions"
    },
    {
      "id": "65bf8e9aa47b43f9b04349cf",
      "_status": "published",
      "createdAt": "2024-02-04T13:18:18.470Z",
      "updatedAt": "2024-08-22T14:42:26.082Z",
      "content": [
        {
          "children": [
            {
              "text": "You can find us in the area of Central Dalmatia (from Šibenik to Makarska + the islands). "
            }
          ]
        },
        {
          "children": [
            {
              "text": "Owners of high-value properties can relax and enjoy while we take care of their property and operations through a comprehensive package. We specifically offer:"
            }
          ]
        },
        {
          "children": [
            {
              "children": [
                {
                  "text": "Year-round property management"
                }
              ],
              "type": "li"
            },
            {
              "children": [
                {
                  "text": "Regular inspections and maintenance of the property, pool, garden, and other facilities"
                }
              ],
              "type": "li"
            },
            {
              "children": [
                {
                  "text": "Organisation of renovations, repairs, refurbishments, and other construction work on the property"
                }
              ],
              "type": "li"
            },
            {
              "children": [
                {
                  "text": "Expert management of accommodation bookings, product management, and marketing"
                }
              ],
              "type": "li"
            },
            {
              "children": [
                {
                  "text": "Guest reception and concierge services during their stay"
                }
              ],
              "type": "li"
            },
            {
              "children": [
                {
                  "text": "Sale of excursions and other tourist activities"
                }
              ],
              "type": "li"
            },
            {
              "children": [
                {
                  "text": "Organisation of transfers, car rental, boat rental, and similar services"
                }
              ],
              "type": "li"
            },
            {
              "children": [
                {
                  "text": "Cleaning of accommodation"
                }
              ],
              "type": "li"
            },
            {
              "children": [
                {
                  "text": "Procurement of all necessary permits and other legal and administrative tasks"
                }
              ],
              "type": "li"
            },
            {
              "children": [
                {
                  "text": " Administration and accounting related to bookings and cost control"
                }
              ],
              "type": "li"
            },
            {
              "children": [
                {
                  "text": "And many other services"
                }
              ],
              "type": "li"
            }
          ],
          "type": "ul"
        },
        {
          "children": [
            {
              "text": "We are particularly desirable to property owners from German-speaking areas because we are native speakers of both languages, providing our clients with the best possible support in all aspects."
            }
          ]
        },
        {
          "children": [
            {
              "text": "We are also recognised as a specialist agency for villa owners from German-speaking countries and use our bilingualism to offer attractive solutions for non-EU owners with our tax saving schemes. This expertise allows us to offer customised services that meet the unique needs of international property owners."
            }
          ]
        },
        {
          "children": [
            {
              "text": "Other languages: German, French, Croatian."
            }
          ]
        },
        {
          "children": [
            {
              "text": "Our long-standing references and frequent recognition from independent organisations are the best testimony to our professional work."
            }
          ]
        }
      ],
      "photo": {
        "id": "66825950dff6423999ad4717",
        "filename": "Dubrovnik Hideaway (19).webp",
        "mimeType": "image/webp",
        "filesize": 1579286,
        "width": 4608,
        "height": 3074,
        "createdAt": "2024-07-01T07:22:56.050Z",
        "updatedAt": "2024-07-01T07:22:56.050Z",
        "url": "/photos/Dubrovnik Hideaway (19).webp"
      },
      "title": "Year-Round Maintenance of the Villa and Booking Management in German, English and Croatian Level ",
      "hiddenPost": false
    }
  ],
  "totalDocs": 5,
  "limit": 10,
  "totalPages": 1,
  "page": 1,
  "pagingCounter": 1,
  "hasPrevPage": false,
  "hasNextPage": false,
  "prevPage": null,
  "nextPage": null
}
